const commonSectionsTranslations = {
  pricingsSection: {
    subtitle: 'الباقات و الاسعار',
    title: 'اختار النظام المناسب لك',
    planType: {
      title: 'أختار برنامجك',
      1: 'برنامج تدريبي مع برنامج غذائي',
      2: 'برنامج تدريبي فقط',
      3: 'برنامج غذائي فقط',
    },
    planDuration: {
      title: 'اختار مدة الاشتراك',
      1: 'شهر',
      2: '٣ شهور',
      3: '٦ شهور',
      4: '١٢ شهور',
    },
    plansData: {
      headTitle: ': اختار نظام المتابعة المناسب لك',
      silverPackage: {
        title: 'الباقة الفضية',
        1: '٢٤/٧ خدمة عملاء انفورمة',
        2: 'متابعة شهرية على الايميل الخاص بكابتن حسين (انفورمة)',
        3: 'متابعة يوم و يوم مع كابتن معتمد من فريق انفورمة',
        4: 'متابعة يومية مع كابتن معتمد من فريق انفورمة',
        5: 'متابعة اسبوعية على الايميل الخاص بكابتن حسين (انفورمة)',
        6: 'متابعة اسبوعية على الواتساب الخاص بكابتن حسين (انفورمة)',
      },
      goldenPackage: {
        title: 'الباقة الذهبية',
        1: '٢٤/٧ خدمة عملاء انفورمة',
        2: 'متابعة شهرية على الايميل الخاص بكابتن حسين (انفورمة)',
        3: 'متابعة يوم و يوم مع كابتن معتمد من فريق انفورمة',
        4: 'متابعة يومية مع كابتن معتمد من فريق انفورمة',
        5: 'متابعة اسبوعية على الايميل الخاص بكابتن حسين (انفورمة)',
        6: 'متابعة اسبوعية على الواتساب الخاص بكابتن حسين (انفورمة)',
      },
      megaPackage: {
        title: 'الباقة الميجا',
        1: '٢٤/٧ خدمة عملاء انفورمة',
        2: 'متابعة شهرية على الايميل الخاص بكابتن حسين (انفورمة)',
        3: 'متابعة يوم و يوم مع كابتن معتمد من فريق انفورمة',
        4: 'متابعة يومية مع كابتن معتمد من فريق انفورمة',
        5: 'متابعة اسبوعية على الايميل الخاص بكابتن حسين (انفورمة)',
        6: 'متابعة اسبوعية على الواتساب الخاص بكابتن حسين (انفورمة)',
      },
    },
    actionButton: 'اختيار',
  },
  contactUsSection: {
    title: 'مساعدتك تهمنا اترك لنا رسالتك ',
    gradientTitle: 'الان',
    description: 'اترك لنا رسالة و سوف نتواصل معك خلال ٢٤ ساعة',
  },
  socialMediaRecords: {
    subtitle: 'عائلتنا',
    title: 'عائلة',
    gradientTitle: 'انفورما',
  },
};

export default commonSectionsTranslations;
