const footerTranslations = {
  links: {
    title: 'انفورما',
    1: 'الرئيسية',
    2: 'وحوش انفورما',
    3: 'الخطط و الاسعار',
    4: 'من نحن',
    5: 'تواصل معنا',
  },
  about: `حسين سيد (انفورمة) هو مدرب شخصي و اخصائي غذائي معتمد من الجامعة الدولية لعلوم الرياضة. مهمته الاساسية هي مساعدة الناس لتغير تفكيرهم و  اجسامهم للحصول علي اسلوب حياة افضل و اكثر صحة`,
  contact: {
    title: 'تواصل  معنا',
  },
  termsConditions: {
    title: 'الشروط و الاحكام',
    1: 'سياسة الاسترجاع',
  },
};

export default footerTranslations;
