import React from 'react';
// material
import {
  Accordion,
  AccordionDetails,
  AccordionSummary,
  Box,
  Container,
  Grid,
  Typography,
  useTheme,
} from '@mui/material';
import ExpandMoreIcon from '@mui/icons-material/ExpandMore';
// components
import SectionWrapper from 'src/components/SectionWrapper';

// --------------------------------------------------------------------------------------------

const GuideElement = ({ title, details }) => {
  return (
    <Accordion TransitionProps={{ unmountOnExit: true }}>
      <AccordionSummary expandIcon={<ExpandMoreIcon />} aria-controls="panel1a-content" id="panel1a-header">
        <Typography>{title}</Typography>
      </AccordionSummary>
      <AccordionDetails>
        <Typography>{details}</Typography>
      </AccordionDetails>
    </Accordion>
  );
};

// --------------------------------------------------------------------------------------------

function PlansPricingGuide() {
  const theme = useTheme();

  return (
    <Box sx={{ backgroundColor: theme.palette.background.neutral, marginTop: 10 }}>
      <Container sx={{ paddingBottom: 10 }}>
        <Grid container spacing={3}>
          <Grid item xs={12}>
            <Typography variant="overline">Guide</Typography>
          </Grid>
          <Grid item xs={12}>
            <Typography variant="h2">Plans & Pricings Guide</Typography>
          </Grid>
          <Grid item xs={12}>
            <Box>
              <GuideElement
                title="شرح النظام"
                details={`بعد التسجيل و دفع مبلغ الاشتراك

➖ خدمه العملاء بتتواصل معك لتفعيل الاشتراك و الرد علي جميع اسئلتك و استفساراتك طوال رحلتك مع انفورمة وارسال البيانات لكابتن حسين (انفورمه) لتصميم البرنامج مفصل لك بناء على
      -	تفاصيل جسمك
      -	هدفك الرئيسي من البرنامج
      -	أسلوب حياتك
      -	الاكل الغير مرغوب فيه 
      -	اي إصابات او مرض لا قدر الله
      -	و أي تفاصيل اخرى

 ➖ يتم تعديل البرنامج (بحد ادني شهر) علي حسب تغيرات جسمك و التزامك بالبرنامج و التطور بناء على اختياراتك للبرنامج الجديد و رؤية كوتش حسين (انفورمة)

➖ يتم تصميم البرنامج الخاص بك من قبل كابتن حسين (انفورمة) من ٧ الي ١٠ ايام عمل و يتم إرسال البرنامج من الايميل الخاص بكابتن حسين الى الايميل الخاص بك.

➖ تاريخ الاشتراك يبدأ بعد يوم من تاريخ ارسال البرنامج الأول بعد تصميمه و ينتهي بعد انتهاء فتره الاشتراك المختاره (شهر) او (٣شهور) او (٦ شهور) او (١٢ شهر)

➖في حالة المرض او اي اصابة او الكورونا لا قدر الله ، يمكنك تجميد الاشتراك و فترة التجميد تكون كالتالى
      - شهر (لايوجد)
      -٣ شهور (أسبوعين)
      - ٦ شهور (شهر)
      -١٢ شهر ( شهرين) 

➖ برجاء العلم انه لا يتم تصميم الانظمة الغذائية الخاصة بالاشخاص النباتية.`}
              />
              <GuideElement
                title="البرنامج الغذائي"
                details={`➖ كابتن حسين (انفورمة) بيصمم لحضرتك برنامج مفصل لك مبنى على اساس علمى و بيكون بناءً علي 
      - وزن الجسم و طوله
      - هدفك الأساسي من البرنامج
      - نسب الدهون و العضلات
      - نوع جسمك 
      - عدد ايام التمرين
      - مواعيد الوجبات المفضل لديك 

➖ يتم تصميم البرنامج من قبل كابتن حسين (انفورمة) بناء على عدد الوجبات المفضله لديك فى اليوم و يتم وضع الأكل المرغوب به  فى البرنامج و محاولة تجنب اى اكل غير مرغوب فيه فى البرنامج.

➖ النظام محسوب بالسعرات الحرارية و احتياج جسمك من بروتين، كربوهيدرات، و دهون، النظام بيكون فيه كل العناصر الغذائية المطلوبه للجسم. 

➖ يوجد بدائل لكل وجبه فى البرنامج لحريه الاختيار يوميا الأكل المرغوب به اليوم و عدم الأحساس بالملل او الإجبار على وجبه محدده.

➖ يوجد مع كل وجبه السعرات الحرارية الخاصة بها (بروتين، كربوهيدرات، دهون) لسهولة ضم اى وجبه خارجيه عن البرنامج بالسعرات الحرارية المطلوبة.
 
➖ الأكل مذكور بالوزن بالجرام لكل صنف أو أكلة مع التوصيات و التعليمات والبدائل لكل وجبه. 

➖ يوجد فيديوهات من (مطبخ انفورمة) لطريقة الطبخ و تتبيل الأكل.

➖ فى الاشتراك اكثر من شهر،  بعد الأسبوع الثالث خدمه العملاء تتواصل مع حضرتك لارسال البيانات لكابتن`}
              />
              <GuideElement
                title="البرنامج التدريبي"
                details={`➖ يتم تصميم البرنامج لرفع المستوي البدني الخاص بك و تحقيق أهدافك المتفق عليها مسبقاً. 

➖ البرنامج مصمم علي حسب عدد الأيام اللي قادر تتمرن فيها سواء كان في الچيم أو في البيت.

➖البرنامج مفصل لأبعد درجة من أول بدء التمرين لنهايته. 

➖مذكور في التمرين
      -التسخين قبل التمرين (بالفيديوهات)
      - تقسيمة التمارين علي الأسبوع
      - أسماء التمارين و العضلات المستهدفة
      - فيديو لكل تمرين أو حركة هتعملها
      -عدد المجاميع لكل تمرينة
      - عدد العدات المرغوب تنفيذها
      - وقت الراحة بين المجاميع

➖ كابتن حسين بيكتبلك النظام علي حسب الأجهزه المتاحه و كمان كل تمرين بيكون معاه فيديو لكابتن حسين بيشرح فيه التمرين و الطريقه الصحيحه و الطريقه الخاطئة و ايه الخطأ الى ممكن تقع فيه و ازاى تتجنبه و ايه البديل للتمرين لو الجهاز مش متاح .. هو بيعلمك كل حاجة عن التمرين علشان تلعبه صح.

➖ فى الاشتراك اكثر من شهر،  بعد الأسبوع الثالث خدمه العملاء تتواصل مع حضرتك لارسال البيانات لكابتن حسين انفورمة بالنتائج وشرح له الأهداف القادمة لتصميم برنامج الشهر الجديد`}
              />
              <GuideElement
                title="متابعة الباقة الميجا"
                details={`➖ بعد الدفع مباشراً سيتم التواصل معك من خدمة عملاء انفورمة لإرسال أسئلة إلكترونيه علشان يكون فيها كل المعلومات الكافية عنك و عن هدفك و بناءً عليه كابتن حسين (انفورمه)  بيقوم بعمل برنامج مخصص لك على تفاصيل ومعلومات جسمك.

➖ خدمة عملاء انفورمة بتكون متاحة معك طوال فترة الاشتراك لاى استفسار عن تفاصيل اشتراكك و مساعدك فى حل اى شكوى. 

➖ متابعة أسبوعية مع كابتن حسين (انفورمه)عبر الواتساب الخاص به، كل أسبوع بيتم إرسال صور و مقاسات الجسم و الوزن  لكابتن حسين (انفورمة) عن طريق الواتساب الخاص به فى ميعاد متفق عليه بينكم للتقييم و كمان لو حابب تسأل عن اي حاجة اضافية هيكون معك للجواب على اى استفسار او استقبال اى شكوى.

➖ المتابعة الميجا بتكون طوال ايام الاسبوع من السبت للخميس باستثناء الجمعة مع كابتن معتمد من فريق انفورمة فى ميعاد متفق عليه بيتم تحديده مع فريق خدمة العملاء بما يتناسب مع احتياجاتك. 

➖ في ايام المتابعة بيتواصل معاك كابتن معتمد من فريق انفورمة فى ميعاد محدد متفق عليه عن طريق الواتساب عشان يتابع معك خطوة بخطوة و يشجعك على الالتزام و الرد على جميع استفساراتك خلال رحلتك و يقدر يساعدك اذا كنت تحتاج لتبديل اى تمرين بتمرين اخر او اى وجبة بوجبة اخرى مهمته الاساسية انه يطمن ان مفيش اي عقبات بتواجهك و يتابع كل التطورات اللي بتحصل و يكون وراك دايما عشان يشجعك و يحفزك علشان تقدروا توصلوا سوى لهدفك الرئيسي.
 
➖ إذا كنت مشترك اكثر من شهر هيتم التواصل معك من قبل خدمة عملاء انفورمة قبل إنتهاء الشهر بأسبوع لإرسال اسئلة إلكترونية جديدة لتحديث البيانات للشهر الجديد علشان كابتن حسين (انفورمه) يعرف من خلالها المعلومات الكافية عن الشهر و عن التغيرات و يبدأ العمل على برنامج الشهر الجديد.

➖ إذا أمكن بيتم عمل Inbody شهريًا، لتقيم افضل للنتائج و متابعة التطور بشكل افضل.`}
              />
              <GuideElement
                title="متابعة الباقة الذهبية"
                details={`➖ بعد الدفع مباشراً سيتم التواصل معك من خدمة عملاء انفورمة لإرسال أسئلة إلكترونيه علشان يكون فيها كل المعلومات الكافية عنك و عن هدفك و بناءً عليه كابتن حسين (انفورمه)  بيقوم بعمل برنامج مخصص لك على تفاصيل ومعلومات جسمك.

➖ خدمة عملاء انفورمة بتكون متاحة معك طوال فترة الاشتراك لاى استفسار عن تفاصيل اشتراكك و مساعدك فى حل اى شكوى. 

➖ المتابعة الذهبية بتكون ٣ ايام فى الاسبوع فى ميعاد متفق عليه بيتم تحديده مع فريق خدمة العملاء بما يتناسب مع احتياجاتك. 

➖ في ايام المتابعة بيتواصل معاك كابتن معتمد من فريق انفورمة فى ميعاد محدد متفق عليه عن طريق الواتساب عشان يتابع معك خطوة بخطوة و يشجعك على الالتزام و الرد على جميع استفساراتك خلال رحلتك و يقدر يساعدك اذا كنت تحتاج لتبديل اى تمرين بتمرين اخر او اى وجبة بوجبة اخرى مهمته الاساسية انه يطمن ان مفيش اي عقبات بتواجهك و يتابع كل التطورات اللي بتحصل و يكون وراك دايما عشان يشجعك و يحفزك علشان تقدروا توصلوا سوى لهدفك الرئيسي.

➖ متابعة أسبوعية مع كابتن حسين (انفورمه)، كل أسبوع بيتم إرسال صور و مقاسات الجسم و الوزن  لكابتن حسين (انفورمة) عن طريق الايميل الخاص به للتقييم و كمان لو حابب تسأل عن اي حاجة اضافية هيكون معك للجواب على اى استفسار او استقبال اى شكوى.
 
➖ إذا كنت مشترك اكثر من شهر هيتم التواصل معك من قبل خدمة عملاء انفورمة قبل إنتهاء الشهر بأسبوع لإرسال اسئلة إلكترونية جديدة لتحديث البيانات للشهر الجديد علشان كابتن حسين (انفورمه) يعرف من خلالها المعلومات الكافية عن الشهر و عن التغيرات و يبدأ العمل على برنامج الشهر الجديد.

➖ إذا أمكن بيتم عمل Inbody شهريًا، لتقيم افضل للنتائج و متابعة التطور بشكل افضل.`}
              />
              <GuideElement
                title="باقة المتابعة الفضية"
                details={`➖ بعد الدفع مباشراً سيتم التواصل معك من خدمة عملاء انفورمة لإرسال أسئلة إلكترونيه علشان يكون فيها كل المعلومات الكافية عنك و عن هدفك و بناءً عليه كابتن حسين (انفورمه)  بيقوم بعمل برنامج مخصص لك على تفاصيل ومعلومات جسمك.

➖ خدمة عملاء انفورمة بتكون متاحة معك طوال فترة الاشتراك لاى استفسار عن تفاصيل اشتراكك و مساعدك فى حل اى شكوى. 

➖ إذا كنت مشترك اكثر من شهر هيتم التواصل معك من قبل خدمة عملاء انفورمة قبل إنتهاء الشهر بأسبوع لإرسال اسئلة إلكترونية جديدة لتحديث البيانات للشهر الجديد علشان كابتن حسين (انفورمه) يعرف من خلالها المعلومات الكافية عن الشهر و عن التغيرات و يبدأ العمل على برنامج الشهر الجديد.

➖ إذا أمكن بيتم عمل Inbody ، مقاسات للجسم ، صور للجسم (شهريًا) لتقييم افضل لنتائج الشهر المنقضي و إرسالها لكابتن حسين(انفورمه) عبر الايميل الخاص به و هذا اختيارى و ليس إجباري. 

➖ المتابعة الفضية هو نظام متابعة شهري يتم فيها التواصل مع كابتن حسين(انفورمه) بعدد ايميلات محددة (شهريا):
 ١- واحدة لإرسال المعلومات و البيانات عن الجسم
٢- والآخري للإستفسارات بعد إرسال البرنامج.
٣- بعد إنتهاء الشهر بيتم ارسال الصور و النتائج للتقييم.`}
              />
            </Box>
          </Grid>
        </Grid>
      </Container>
    </Box>
  );
}

export default PlansPricingGuide;
