const aboutUsPageTranslations = {
  pageIntro: {
    subtitle: 'من نحن',
    title: 'من نحن',
    description: '',
  },
  aboutInforma: {
    subtitle: 'من نحن',
    title: 'من  ',
    description: `اسمي حسين سيد مدرب شخصي و اخصائي غذائي معتمد من الجامعة الدولية لعلوم الرياضة. مهمتي الاساسية هي مساعدة الناس لتغير تفكيرهم و  اجسامهم للحصول علي اسلوب حياة افضل و اكثر صحة.  

    قبل ما أتفرغ لمجال التدريب، درست خمس سنين هندسة ميكانيكية كا تخصص اساسي و ادارة اعمال كا تخصص فرعي في الجامعة الامريكية في القاهرة. تخرجت سنة ٢٠١٧ بامتياز مع مرتبة الشرف و اشتغلت سنتين في مجال الميكانيكا بجانب التدريب. إلى ان أدركت ان شغفي الحقيقي هو مساعدة الناس لتغيير حياتهم للأفضل عن طريق الرياضة و التغذية.
    
    حاليا خبرتي في مجال الرياضة و التغذية يتخطى الأحد عشر سنة سواء كا لاعب او مدرب. و لقناعتي ان الخبرة يجب ان تخلط بالعلم ليكونوا اساس نجاح، فا قمت بدراسة العديد من المراجع العلمية الخاصة بمجال التدريب و حصلت علي العديد من الشهادات كا شهادة مدرب لياقة بدنية معتمد CFT, اخصائي غذائي معتمد CNC, و شهادة المدرب الشخصي المعتمد CPT. كما أننى مدرس و محاضر في أكاديميات دولية تابعة للاتحاد الاوروبي EREPS. 
    
    انشأت قناتي (انفورمة) علي منصات التواصل الاجتماعي سنة ٢٠١٩ و كان الهدف الاساسي منها هو نشر العلم و النصائح لاكبر عدد من الناس لتغيير منظور الرياضة و التغذية عندهم. و الان ملايين المتابعين من جميع انحاء العالم يستفيدون و يتأثرون ايجابيا من المحتوى المقدم من قبل انفورمة. بلاضافة الى عدد كبير من العملاء لدينا في التدريب الاونلاين تم تغيير حياتهم ١٨٠ درجة و وصلوا لاهدافهم معنا.`,
    actionButton: 'غير حياتك',
    gradientTitle: 'نحن',
  },
  certifications: {
    subtitle: 'شهادات انفورمة',
    title: 'بعض من ',
    gradientTitle: 'شهادات انفورمة',
  },
  feedbacks: {
    subtitle: 'الاراء',
    title: 'بعضا من آراء عملائنا',
  },
};

export default aboutUsPageTranslations;
