const checkoutPageTranslations = {
  title: 'ابدأ رحلتك دلوقتي .',
  subtitle: 'أنت على بُعد نقرة واحدة من تغيير حياتك.',
  contactUs: 'تواصل معنا لمزيد من المساعدة',
  generalInfo: { button: 'ابدأ رحلتي' },
  packages: {
    silver: 'الباقة الفضية',
    golden: 'الباقة الذهبية',
    mega: 'الباقة الميجا',
    button: 'اختر المدة',
    subscribeButton: 'اشترك الان',
  },
  packagesInfo: {
    silver: {
      1: 'برنامج غذائي وتدريبي مخصص',
      2: 'متابعة شهرية مع كابتن حسين (انفورمة)',
      3: 'خدمة عملاء على مدار ٢٤/٧',
    },
    golden: {
      1: ' برنامج غذائي وتدريبي مخصص',
      2: 'متابعة يوم بعد يوم مع مدرب معتمد من فريق (انفورمة)',
      3: 'متابعة أسبوعية مع كابتن حسين (انفورمة)',
      4: 'خدمة عملاء على مدار ٢٤/٧',
    },
    mega: {
      1: 'برنامج غذائي وتدريبي مخصص',
      2: 'متابعة يومية مع مدرب معتمد من فريق (انفورمة) ',
      3: 'محادثة أسبوعية مع كابتن حسين (انفورمة) عبر الواتساب',
      4: 'خدمة عملاء على مدار ٢٤/٧',
    },
  },
  duration: {
    1: 'شهر واحد',
    2: '3 أشهر',
    3: '6 أشهر',
    4: '12 شهرًا',
    buttons: { back: 'عودة', submit: 'إرسال' },
  },
  video: {
    title: { 1: 'احصل', 2: 'على كل', 3: 'ما تريد' },
    subtitle: 'عزّز رحلتك في اللياقة—أمّن خطتك واتخذ الخطوة الأولى نحو حياة أكثر صحة!',
  },
};

export default checkoutPageTranslations;
