const checkoutPageTranslations = {
  title: 'ابدأ رحلتك دلوقتي .',
  subtitle: 'أنت على بُعد نقرة واحدة من تغيير حياتك.',
  contactUs: 'تواصل معنا لمزيد من المساعدة',
  generalInfo: { button: 'ابدأ رحلتي' },
  packages: {
    silver: {
      title: 'الباقة الفضية',
      subtitle: '( الاقتصادية )',
    },
    golden: {
      title: 'الباقة الذهبية',
      subtitle: 'الاكثر مبيعا',
    },
    mega: {
      title: 'الباقة الميجا ',
      subtitle: '( VIP )',
    },
    button: 'اختر المدة',
    subscribeButton: 'اشترك الان',
  },
  packagesFeatures: {
    1: 'برنامج غذائي مخصص بالتفاصيل و السعرات',
    2: 'برنامج تمارين مخصص (چيم او بيت)  ',
    3: 'فيديوهات لتحضير الوجبات',
    4: 'فيديو لكل تمرين وكارديو',
    5: 'نظام تتبع للسعرات والماء',
    6: 'نظام تتبع ديناميكي للتمارين',
    7: 'عدد محدود من الاستفسارات',
    8: 'خدمة العملاء على مدار الساعة',
    9: 'متابعة يوميا واتساب مع مدرب معتمد',
    silver9: 'متابعة مع مدرب معتمد',
    gold9: 'متابعة يوم و يوم واتساب مع مدرب معتمد',
    10: 'متابعة أسبوعية عبر الواتساب مباشرة مع إنفورما',
  },
  packagesInfo: {
    silver: {
      1: 'برنامج غذائي وتدريبي مخصص',
      2: 'متابعة شهرية مع كابتن حسين (انفورمة)',
      3: 'خدمة عملاء على مدار ٢٤/٧',
    },
    golden: {
      1: ' برنامج غذائي وتدريبي مخصص',
      2: 'متابعة يوم بعد يوم مع مدرب معتمد من فريق (انفورمة)',
      3: 'متابعة أسبوعية مع كابتن حسين (انفورمة)',
      4: 'خدمة عملاء على مدار ٢٤/٧',
    },
    mega: {
      1: 'برنامج غذائي وتدريبي مخصص',
      2: 'متابعة يومية مع مدرب معتمد من فريق (انفورمة) ',
      3: 'محادثة أسبوعية مع كابتن حسين (انفورمة) عبر الواتساب',
      4: 'خدمة عملاء على مدار ٢٤/٧',
    },
  },
  duration: {
    1: 'شهر واحد',
    2: '3 أشهر',
    3: '6 أشهر',
    4: '12 شهرًا',
    buttons: { back: 'عودة', submit: 'إرسال' },
    5: '3 أشهر + 1 شهر مجاني',
  },
  video: {
    title: { 1: 'احصل', 2: 'على كل', 3: 'ما تريد' },
    subtitle: 'عزّز رحلتك في اللياقة—أمّن خطتك واتخذ الخطوة الأولى نحو حياة أكثر صحة!',
  },
};

export default checkoutPageTranslations;
