const homePageTranslations = {
  heroSection: {
    title: 'اتحدى نفسك',
    secondaryTitle: 'ابدأ رحلتك مع انفورمة',
    mainActionButton: 'اشترك الان',
    secondaryActionButton: 'وحوش انفورمة',
  },
  socialMediaRecords: {
    title: 'ليس لدينا متابعين… نحن لدينا عائلة',
  },
  aboutUs: {
    title: 'قصة انفورما',
    firstDescriptionParagraph: `حسين سيد (انفورمة) هو مدرب شخصي و اخصائي غذائي معتمد من الجامعة الدولية لعلوم الرياضة. مهمته الاساسية هي مساعدة الناس لتغير تفكيرهم و  اجسامهم للحصول علي اسلوب حياة افضل و اكثر صحة`,
    secondDescriptionParagraph: `قبل ما أن يتفرغ لمجال التدريب، درس هندسة ميكانيكية كا تخصص اساسي و ادارة اعمال كا تخصص فرعي في الجامعة الامريكية في القاهرة. تخرج سنة ٢٠١٧ بامتياز مع مرتبة الشرف و عمل سنتين في مجال الميكانيكا بجانب التدريب. إلى ان أدرك ان شغفه الحقيقي هو مساعدة الناس لتغيير حياتهم للأفضل عن طريق الرياضة و التغذية`,
    thirdDescriptionParagraph: `حاليا خبرته في مجال الرياضة و التغذية يتخطى الأحد عشر سنة سواء كا لاعب او مدرب. و لقناعته ان الخبرة يجب ان تخلط بالعلم ليكونوا اساس نجاح، فا قام بدراسة العديد من المراجع العلمية الخاصة بمجال التدريب و حصل علي العديد من الشهادات كا شهادة مدرب لياقة بدنية معتمد CFT, اخصائي غذائي معتمد CNC, و شهادة المدرب الشخصي المعتمد CPT. كما أنه مدرس و محاضر في أكاديميات دولية تابعة للاتحاد الاوروبي EREPS`,
    fourthDescriptionParagraph: `أنشئ (انفورمة) علي منصات التواصل الاجتماعي سنة ٢٠١٩ و كان الهدف الاساسي منها هو نشر العلم و النصائح لاكبر عدد من الناس لتغيير منظور الرياضة و التغذية عندهم. و الان ملايين المتابعين من جميع انحاء العالم يستفيدون و يتأثرون ايجابيا من المحتوى المقدم من قبل انفورمة. بلاضافة الى عدد كبير من العملاء لديه في التدريب الاونلاين تم تغيير حياتهم ١٨٠ درجة و وصلوا لاهدافهم`,
    actionButton: 'اعرف اكتر',
  },
  transformations: {
    subtitle: 'وحوش انفورمة',
    title: 'انضم الان و كن واحد من وحوش انفورمة',
  },
  services: {
    1: {
      title: 'البرنامج التدريبى',
      description: 'برنامج مخصص لك للرفع مستوى البدنى الخاص بك و تحقيق هدفك',
      actionButton: 'تفاصيل ',
    },
    2: {
      title: 'البرنامج الغذائى',
      description: 'برنامج مخصص لك بناء على هدفك، الاكل المرغوب فيه و تفاصيل حياتك',
      actionButton: 'تفاصيل  ',
    },
    3: {
      title: 'المتابعة',
      description: 'متابعة استفساراتك و تطورك خطوة بخطوة للتأكد من وصولك لتحقيق هدفك.',
      actionButton: 'تفاصيل',
    },
  },
  haveQuestions: {
    subtitle: 'تواصل معنا',
    title: 'تريد المساعدة؟ تواصل معنا الان',
    actionButton: 'تواصل معنا عبر الواتس اب',
  },
};

export default homePageTranslations;
